Public Class Details

    Private Sub CheckedListBox1_SelectedIndexChanged(ByVal sender As System.Object, ByVal e As System.EventArgs) Handles CheckedListBox1.SelectedIndexChanged
        Select Case CheckedListBox1.SelectedIndex
            Case 0
                PictureBox1.Image = My.Resources.M10
                TextBox1.Text = "เรื่องราวความรักแห่ง Titanic ปรากฏขึ้นบนเรือ R.M.S. Titanic ที่ออกเดินเรืออันเป็นโศกนาฏกรรมครั้งแรก โดยน่าจะเป็นเรือที่มีชื่อเสียงมากที่สุดในประวัติศาสตร์ ในปี  1912 เรือไททานิค คือ เรือที่มีการเดินเรือครั้งยิ่งใหญ่ที่สุดเท่าที่เคยสร้างเรือมาบนความภูมิใจและความยินดีของผู้โดยสารเรือไอน้ำ White Star Line ไททานิคได้รับการขนานนามว่าเป็นเรือที่มีความหรูหราและล้ำสมัยที่สุดในยุคนั้น จนในที่สุด เรือแห่งความฝัน ได้มีการออกทะเลก่อนยุคแห่งการบิน แต่สุดท้ายเรือได้พาผู้โดยสารมากกว่า 1,500 คนไปพบกับจุดจบในน้ำที่หนาวเย็นทางแอตแลนติกเหนือเมื่อวันที่ 15 เมษายนของ 100 ปีที่แล้ว"
                Label3.Text = "เรือไททานิค"


            Case 1
                PictureBox1.Image = My.Resources.M1
                TextBox1.Text = "เป็นภาพยนตร์อิงประวัติศาสตร์ เน้นถึงเหตุการณ์ที่เกิดขึ้นในชีวิตของตัวละครเอก คือ พระสุริโยไท พระมเหสีของสมเด็จพระมหาจักรพรรดิ พระมหากษัตริย์แห่งกรุงศรีอยุธยา พระสุริโยไท ทรงเจ้านายฝ่ายเหนือราชวงศ์พระร่วง ตั้งแต่พระชนมายุ ๑๕ พรรษา ได้ทรงอภิเษกสมรสกับพระเยาวราช จากราชวงศ์สุพรรณภูมิ คือ พระเฑียรราชา โอรสขององค์อุปราช พระอาทิตยา กับพระสนม ซึ่งครองเมืองพิษณุโลกอยู่ในเวลานั้น"
                Label3.Text = "พระสุริโยทัย"

            Case 2
                PictureBox1.Image = My.Resources.M5
                TextBox1.Text = "เป็นเรื่องราวความรักข้ามกาลเวลา ของ เกศสุรางค์ หญิงสาวร่างอ้วน หน้าตาธรรมดาๆ เธอหลงรักเพื่อนสนิท เรืองฤทธิ์ ที่คบกันมาเป็นเวลานาน แต่ไม่กล้าเผยใจออกไป จนกระทั่งเกศสุรางค์เกิดอุบัติเหตุจนตัวเองเสียชีวิต และวิญญาณกลับไปสู่ยุคกรุงศรีอยุธยา ในร่างของการะเกด สาวสวยแต่มีจิตใจร้ายกาจ ได้กระทำเรื่องลอบทำร้ายแม่หญิงจันทร์วาดด้วยความหึงหวง จนตัวเองต้องมนต์กฤษณะกาลี ทำให้ตัวเองมีอันเป็นไป ก่อนวิญญาณของการะเกดจะหายไป ก็ขอให้เกศสุรางค์ทำความดีแทนตัวของเธอด้วยเกศสุรางค์ในร่างของการะเกดจึงได้ผูกสัมพันธ์กับหมื่นสุนทรเทวาแต่ก็ต้องยับยั้งชั่งใจเพราะตัวเองคิดว่าสักวันต้องกลับไปโลกเดิมของเธอ และเธอได้ตั้งสัตย์ปฎิณาณไว้ว่าจะรักเรืองฤทธิ์แต่เพียงผู้เดียว"
                Label3.Text = "แม่หญิงเกศสุรางค์"

            Case 3
                PictureBox1.Image = My.Resources.M6
                TextBox1.Text = "เป็นเรื่องราวของ วันทอง หญิงสาวรูปงามที่ถูกตราหน้าว่าเป็นผู้หญิงสองใจกำลังถูกพระพันวษาไต่สวนกระบวนความหลังเกิดศึกชิงตัวนางวันทองระหว่างขุนแผนกับขุนช้าง" + vbNewLine + "ขุนช้าง กับขุนแผน เป็นอดีตเพื่อนรักเพื่อนซี้ที่เกิดไปหลงรักหญิงสาวคนเดียวกันนั่นก็คือวันทอง ทีนี้เพื่อเป็นการยุติเรื่องราวทั้งหมดพระพันวษาจึงให้วันทองเลือกว่าจะไปอยู่กับใครแต่เมื่อต้องเลือกวันทองกลับเลือกไม่ได้ทำให้พระพันวษาโกรธจัดสั่งประหารชีวิตวันทองทันทีแต่ก่อนที่ชีวิตเธอจะดับดิ้นด้วยคมดาบของเพชฌฆาต วันทองจึงขอใช้สิทธิ์เป็นครั้งสุดท้ายเล่าเรื่องราวความรักอันซับซ้อนเพื่อเรียกร้องความเป็นธรรมให้กับตัวเองและเพื่อให้สังคมได้รับรู้ความจริงที่เกิดขึ้น"
                Label3.Text = "นางวันทอง"

            Case 4
                PictureBox1.Image = My.Resources.M7
                TextBox1.Text = "เป็นเรื่องราวในช่วงสงครามโลกครั้งที่ 2 (พ.ศ. 2484) ญี่ปุ่นเข้ามาในไทย  โกโบริเป็นหนึ่งในกองทัพที่เข้ามา ได้พบกับ อังศุมาลิน สาวน้อยที่เล่นน้ำอยู่ใกล้ๆกับอู่ซ่อมเรือที่เขาทำงานโดยบังเอิญเธออยู่กับเเม่เเละยายสองคน เขาเกิดความชอบขึ้นมาเเละพยายามไปมาหาสู่อยู่เสมอ ในขณะที่อังศุมาลินกลับต่อต้านและค่อยข้างจะใจร้ายกับเขา เเต่ทุกครั้งที่เกิดเรื่องเลวร้าย ทั้งคู่จะได้พบกันเสมอ ก่อให้เกิดความรักขึ้นอย่างช้าๆ เเต่ทว่า เมื่อมีเหตุการณ์บางอย่างที่ทำให้ทั้งคู่ต้องเเต่งงานเพื่อเชื่อมความสัมพันธ์ของสองประเทศ อังศุมาลินจำใจเเต่งงานกับโกโบริ ทั้งที่มีสัญญาติดค้างกับใครบางคน นำมาสู่ความขมขื่นของหัวใจทั้งสองดวง ที่เมื่อเข้าใจก็อาจจะสายเกินเเก้แล้ว"
                Label3.Text = "โกโบริ กับ อังศุมาลิน"

            Case 5
                PictureBox1.Image = My.Resources.M8
                TextBox1.Text = "เป็นภาพยนตร์อิงประวัติศาสตร์ มีทั้งหมด 6 ภาค เป็นภาคต่อจากภาพยนตร์เรื่อง สุริโยไท" + vbNewLine + "โดยเรื่องนี้ขอเท้าความแค่ภาคที่1 ในเมื่อปี พุทธศักราช 2106 พระเจ้าบุเรงนอง กษัตริย์แห่งกรุงหงสาวดีของพม่า ได้กรีฑาทัพมาตีกรุงอโยธยาศรีรามเทพนคร โดยเดินทัพผ่านทางด่านแม่ละเมา แขวงเมืองตาก ทัพพม่ารามัญซึ่งมีรี้พลเหลือคณานับได้เข้ายึดครองหัวเมืองฝ่ายเหนือของอาณาจักรสยาม อันได้แก่ กำแพงเพชร สุโขทัย และสวรรคโลก จนรุกมาถึงเมืองพระพิษณุโลกสองแคว อันเป็นราชธานีฝ่ายเหนือ ในครั้งนั้น สมเด็จพระมหาธรรมราชา เจ้าผู้ครองเมืองพิษณุโลก ตัดสินพระทัยอ่อนน้อมต่อพระเจ้าบุเรงนอง ด้วยทรงน้อยพระทัยที่อโยธยาไม่ส่งทัพมาสนับสนุนและก็เพื่อยุติการสู้รบและการสูญเสีย จึงทรงยอมร่วมกระบวนทัพพม่าเข้าตีกรุงศรีอยุธยา โดยต้องทรงยอมถวายพระองค์ดำหรือพระนเรศวร พระราชโอรสองค์โตต่อพระเจ้าหงสาวดีเพื่อเป็นองค์ประกัน ในเวลานั้นพระนเรศร มีพระชนมายุเพียง 9 ชันษา"
                Label3.Text = "เท้าความภาคที่๑ องค์ประกันหงสา"

            Case 6
                PictureBox1.Image = My.Resources.M9
                TextBox1.Text = "เรื่องราวของแม่พลอย แม่หญิงในตระกูลขุนนางเก่า ที่มีชีวิตอยู่แต่ในรั้วในวัง เป็นผู้มองเหตุการณ์ต่างๆ ด้วยค่านิยมของผู้ใกล้ชิดกับราชสำนัก เมื่อสิ้นรัชกาลที่ 5 พลอยได้ออกมาอยู่นอกวัง โดยได้สามี คือ เปรม ซึ่งเป็นข้าราชการ และก็ยังคงมีความเกี่ยวข้องกับราชสำนัก ครั้นถึงสมัยรัชกาลที่ 7 เกิดการเปลี่ยนแปลงการปกครอง ค่านิยมแบบเก่าของพลอยถูกกระทบกระเทือนหนักขึ้น เพราะความเห็นขัดแย้งทางการเมืองของลูกชายสามคน เมื่อเหตการณ์ทำท่าจะดีขึ้น ยุคสมัยก็เปลี่ยนไปอีก เมื่อรัชกาลที่ 8 สวรรคต อันเป็นสาเหตุที่ทำให้พลอยไม่สามารถจะทานทนได้ และในวันที่พระเจ้าอยู่หัวรัชกาลที่ 8 สวรรคต พลอยก็ถึงแก่กรรมพร้อมไปด้วย"
                Label3.Text = "แม่พลอย กับ คุณเปรม"
            Case 7
                PictureBox1.Image = My.Resources.M2
                TextBox1.Text = "เป็นภาพยนตร์ตลก-สยองขวัญ(Horror comedy) โดยการดัดแปลงจากตำนานแม่นาคพระโขนง ซึ่งเป็นผีพื้นบ้านของไทย มีการเล่าเรื่องโดยเริ่มเรื่องจากการกลับมาพบกันของนายมากและนางนาค โดยที่นางนาคได้เสียชีวิตไปแล้ว ปัญหาเริ่มก่อตัวขึ้นเมื่อเพื่อนทั้ง 4คน ของนายมากเริ่มสงสัยว่านางนาคไม่ใช่คน ภายใต้ความคิดที่ว่า คนและผีไม่สามารถอยู่ร่วมกันได้ ภาวะวิกฤตของพี่มาก..พระโขนง แบ่งเป็น 2 ช่วง ได้แก่ ช่วงที่นายมากแน่ใจว่า นางนาคเป็นผี และช่วงที่นางนาคโกรธที่เพื่อนทั้ง4 คนของนายมากขัดขวางการอยู่ร่วมกันของนายมากและนางนาค และเรื่องเริ่มคลี่คลายเมื่อทั้งนายมากและนางนาคได้เปิดใจพูดคุยกัน ทำให้ปัญหาเกี่ยวกับการอยู่ร่วมกันระหว่างคนและผี หมดไป โดยทั้งคู่ต่างตกลงใจที่จะอยู่ร่วมกันต่อไป"
                Label3.Text = "แม่นาก กับ พี่มาก"

            Case 8
                PictureBox1.Image = My.Resources.M3
                TextBox1.Text = "นำเสนอเรื่องราวของชายหนุ่มและหญิงสาวชาวไทยที่ไปเที่ยวประเทศเกาหลี แล้วพบกันโดยบังเอิญ ทั้งสองตกลงที่จะไม่บอกชื่อแก่กัน และออกเที่ยวเกาหลีด้วยกัน ใช้สถานที่ถ่ายทำในประเทศเกาหลีในหลากหลายฉากที่เกี่ยวข้องกับละครซีรีส์เกาหลีที่ฉายในประเทศไทย"
                Label3.Text = "ชายหนุ่ม นามแฝงว่า ด่าง / หญิงสาว นามแฝงว่า เม"

            Case 9
                PictureBox1.Image = My.Resources.M4
                TextBox1.Text = "คำแก้ว สาวงามแห่งบ้านดอนไม้ป่ามีชาติกำเนิดที่ลึกลับ กายหยาบที่ เจ้าแม่นาคี ใช้อาศัยอยู่หลังจากได้บำเพ็ญศีลมาเป็นเวลาเกือบพันปีตามคำสาปของ เจ้าปู่ศรีสุทโธนาค เมื่อล่วงรู้ว่าหลานสาวหนีขึ้นมาบนโลกมนุษย์สมสู่กับ ไชยสิงห์ จนมีลูกชายหนึ่งคน นาคีกลัวเจ้าปู่รู้จึงเสกลูกชายให้เป็นปลาไหลเผือก แต่ลูกของนาคีกลับถูกมนุษย์จับไปกิน ทำให้นางโกรธแค้นข้ามภพข้ามชาติ เมื่อกลับมาอยู่ในร่างของคำแก้ว และได้พบรักกับ ทศพล ชายคนรักในอดีตชาติที่เคยมีสัญญาต่อกัน เจ้าแม่นาคีจึงทำทุกทางเพื่อให้ได้ครองรักกับชายคนรักอีกครั้ง"
                Label3.Text = "คำแก้ว"
        End Select
    End Sub

    Private Sub Button6_Click(ByVal sender As System.Object, ByVal e As System.EventArgs) Handles Button6.Click
        Movies.Show()
        Me.Hide()
    End Sub

    Private Sub Button7_Click(ByVal sender As System.Object, ByVal e As System.EventArgs) Handles Button7.Click
        End
    End Sub
End Class
